Revit 2027 API
RebarHandlesData.GetCustomHandles Method
 Gets the handle definitions for the rebar that were added.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetCustomHandles()
Public Function GetCustomHandles As IList(Of Integer)
public:
IList<int>^ GetCustomHandles()
member GetCustomHandles : unit -> IList<int>
Return Value
IList<Int32>
 Returns all custom handles.
See Also
Reference
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace